export default {
  navbar: {
    name: "กฤษดา",
    about: "เกี่ยวกับฉัน",
    experience: "ประสบการณ์",
    skills: "ทักษะ",
    projects: "ผลงาน",
    contact: "ติดต่อ",
  },
  hero: {
    title: "ยินดีต้อนรับสู่เว็บไซต์พอร์ตฟอลิโอของฉัน",
    name: "กฤษดา",
    lastName: "บุตนาม",
    resume: "เรซูเม่",
  },
  about: {
    title: "เกี่ยวกับฉัน",
    description: "ประวัติย่อและประวัติการศึกษา",
    personalInformation: "ข้อมูลส่วนตัว",
    educationInformation: "ประวัติการศึกษา",
    name: "ชื่อ",
    nameText: "นาย กฤษดา บุตนาม",
    age: "อายุ",
    phone: "เบอร์โทร",
    email: "อีเมล",
    lineId: "ไอดี Line",
    education: {
      highSchoolTitle: "มัธยมศึกษา",
      highSchoolText: "โรงเรียนศรีวิไลวิทยา",
      universityTitle: "อุดมศึกษา",
      universityText: "มหาวิทยาลัยราชภัฏอุดรธานี",
    },
  },
  workExperience: {
    title: "ประสบการณ์การทำงาน",
    description: "ข้อมูลเกี่ยวกับประสบการณ์การทำงาน",
    experience1: {
      dateRange: "10 กรกฎาคม 2566 - ปัจจุบัน",
      companyName: "บริษัท แวนเนส พลัส คอนซัลติ้ง จำกัด",
      position: "โปรแกรมเมอร์",
      responsibilities:
        "สร้างและพัฒนาเว็บไซต์ที่ทำงานได้อย่างสมบูรณ์โดยใช้ภาษาโปรแกรมสมัยใหม่ (PHP, Vue, Nuxt, MySQL) เพื่อให้มั่นใจถึงความสามารถในการตอบสนอง การปรับขยาย และประสิทธิภาพของเว็บไซต์ ออกแบบอินเทอร์เฟซผู้ใช้ที่น่าดึงดูดและใช้งานง่าย โดยเน้นหลักการออกแบบที่ให้ความสำคัญกับประสบการณ์ผู้ใช้ (UX) เพื่อเพิ่มความสะดวกในการใช้งานและประสิทธิภาพของฟังก์ชันต่าง ๆ เขียนคู่มือผู้ใช้และเอกสารที่ครบถ้วน โดยให้คำแนะนำทีละขั้นตอนและเคล็ดลับการแก้ไขปัญหาให้กับผู้ใช้และสมาชิกในทีม รวมถึงการดูแลและปรับปรุงอย่างต่อเนื่อง",
    },
    experience2: {
      dateRange: "1 เมษายน 2566 - 17 มิถุนายน 2566",
      companyName: "ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร",
      position: "นักศึกษาฝึกงาน",
      responsibilities:
        "งานให้บริการลูกค้า เปิดบัญชี ทําบัตร ATM บัตร A-GEN บัตรทอง ทําแอพพลิเคชั่น A-Mobile แอพพลิเคชั่น Mobile Banking ของธนาคาร สนับสนุนการทํางานสายงานการเงิน พิมพ์เอกสาร ถ่ายเอกสาร ยกกล่องเงินเพื่อนําไปเติมเข้าตู้ ATM สนับสนุนการทํางานสายงานสินเชื่อ พิมพ์ใบแจ้งหนี้ พับใบแจ้งหนี้ คีย์ข้อมูลทําประกัน ธ.ก.ส. ทวีรัก 99 ธ.ก.ส. มอบรัก",
    },
  },
  skills: {
    title: "ทักษะ",
    description: "ข้อมูลเกี่ยวกับทักษะของฉัน",
    level: {
      advanced: "ขั้นสูง",
      intermediate: "ปานกลาง",
      beginner: "ระดับเริ่มต้น",
    },
  },
  project: {
    view: "ดู",
    title: "ผลงาน",
    description: "ผลงานบางส่วนที่เคยทำ",
    project1: {
      title: "ศูนย์การเรียนรู้ชุมชน",
    },
    project2: {
      title: "ระบบบันทึกเวลาปฏิบัติงาน",
    },
    project3: {
      title: "คลังหนัง",
    },
  },
  contact: {
    title: "ติดต่อ",
    description:
      "กรุณากรอกข้อมูลด้านล่างเพื่อติดต่อฉันและให้ฉันทราบว่าคุณสนใจสื่อสารกับฉัน",
    name: "ชื่อ",
    email: "อีเมล",
    message: "ข้อความ",
    submit: "ส่ง",
  },
};
